rails client/app/controllers/requests_controller.rb

SELECT `requests`.* FROM `requests`
---
  def index
    @requests = Request.all

INSERT INTO `requests` (`confirmation_number`, `created_at`, `description`, `received_date`, `sent_date`, `updated_at`) VALUES (NULL, '2010-11-24 15:49:54', 'Test message', NULL, NULL, '2010-11-24 15:49:54')
---
  def create
    puts "Request"
    @request = Request.new(params[:request].merge(:sent_date => DateTime.now))
    @request.save